<div style="text-align:center;">
    <div class="alert alert-block alert-success">
        <b>Assignment 22: Pandas Basics </b>[23_Feb_2023]
    </div>
</div>

# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
data = [4, 8, 15, 16, 23,42]
Panda_Series = pd.Series(data)
print(Panda_Series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

#### Creating a variable contaning list of first ten even numbers

In [4]:
my_list = [i for i in range(1,21) if i%2 == 0]

#### Creating Panda Series for aboe list

In [5]:
Panda_series = pd.Series(my_list)
print(Panda_series )

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

|Name|Age|Gender|
|----|---|----|
|Alice|25|Female|
|Bob|30|Male|
|Claire|27|Female|
# Then, print the DataFrame.

#### First step is to create a dictionary of same data that we want to display in tabular structure.

In [6]:
data = {'Name':['Alice','Bob','Claire'],
       'Age':[25, 30, 27],
       'Gender':['Female','Male','Female']
       }

#### Second step is to use the `pd.DataFrame()` function to convert the dictionary into a Pandas DataFrame and assign it to the `df` variable. Finally, we display the df variable, which will render the DataFrame as a table.

In [11]:
df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

#### A DataFrame is a two-dimensional labeled data structure in pandas, which is one of the most widely used libraries for data manipulation and analysis in Python.

#### In a DataFrame, the data is organized in rows and columns, similar to a spreadsheet or a SQL table. Each column can have a different data type, such as numbers, strings, or dates, and each row represents a unique observation or record. The columns are labeled, and each row has an index that uniquely identifies it within the DataFrame.

#### Pandas provides a wide range of functionality for manipulating, cleaning, and transforming data within a DataFrame, including filtering, grouping, pivoting, merging, and reshaping. DataFrames can also be easily exported to various formats, such as CSV or Excel, for further analysis or visualization in other tools.

#### A DataFrame in pandas is a two-dimensional table-like data structure, while a Series is a one-dimensional array-like data structure.

#### A Series can be thought of as a single column of a DataFrame, and it has an index that labels each element. In contrast, a DataFrame has multiple columns and an index that labels both rows and columns.

#### Here are some other key differences between DataFrames and Series:
1. Dimensionality: A DataFrame has two dimensions (rows and columns), while a Series has only one dimension (rows).
2. Structure: A DataFrame can have multiple columns of different data types, while a Series has only one column of a single data type.
3. Indexing: A DataFrame can be indexed by both row and column labels, while a Series is indexed only by row labels.
4. Operations: Many operations that work on a Series can also be applied to a single column of a DataFrame, but operations that involve multiple columns (such as merging, grouping, or reshaping) require a DataFrame.

#### Here's an example that shows the difference between a DataFrame and a Series:

In [17]:
data = {'Name':['Alice','Bob','Claire'],
       'Age':[25, 30, 27],
       'Gender':['Female','Male','Female']
       }
# Creating a DataFrame
df = pd.DataFrame(data)
print(df)
type(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

In [18]:
# Creating a Series
series = df['Age']
print(series)
type(series)

0    25
1    30
2    27
Name: Age, dtype: int64

pandas.core.series.Series

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

#### Pandas DataFrame provides a wide range of functions for manipulating, cleaning, and transforming data. Here are some common functions you can use to manipulate data in a Pandas DataFrame:

1. head(n) and tail(n) - Return the first n rows or last n rows of the DataFrame.

2. fillna(value) - Fill missing values in the DataFrame with a specified value or method, such as the mean, median, or mode.

3. isnull() and notnull() - Check if the DataFrame contains null (missing) values and return a Boolean DataFrame indicating where the null values are located.

4. sort_values() - Sort the DataFrame by one or more columns, either in ascending or descending order.

5. drop(labels) - Remove rows or columns from the DataFrame based on their labels or positions.

6. describe() - Generate descriptive statistics of the DataFrame, such as count, mean, standard deviation, minimum, maximum, and quartile values.

7. groupby() - Group the DataFrame by one or more columns and apply a function, such as sum, mean, or count, to each group.

8. merge() - Merge two DataFrames based on one or more common columns

9. dropna() -Removes rows or columns with missing (NaN) values from the DataFrame.

10. fillna() - Fills missing (NaN) values in the DataFrame with a specified value or method.

## Examples - 
### 1. dropna():

In [21]:
# Create a DataFrame with missing values
data = {'name': ['Gautam', 'Bob Marley', 'Charlie', 'Dravid', 'Monika', 'Frank', 'Nimish', 'Harry'],
        'age': [20, 25, 30, 35, 40, None, 29, None],
        'gender': ['Male', 'Male', 'Female', 'Male', 'Female', None, 'Male', 'Male']}
df = pd.DataFrame(data)
df

         name   age  gender
0      Gautam  20.0    Male
1  Bob Marley  25.0    Male
2     Charlie  30.0  Female
3      Dravid  35.0    Male
4      Monika  40.0  Female
5       Frank   NaN    None
6      Nimish  29.0    Male
7       Harry   NaN    Male

In [22]:
# Remove rows with missing values
clean_df = df.dropna()

# Print the cleaned data
print(clean_df)

         name   age  gender
0      Gautam  20.0    Male
1  Bob Marley  25.0    Male
2     Charlie  30.0  Female
3      Dravid  35.0    Male
4      Monika  40.0  Female
6      Nimish  29.0    Male

#### In this example, the DataFrame `df` contains missing values for the 'age' and 'gender' columns. The `dropna()` function is used to remove any rows with missing values, resulting in a cleaned DataFrame `clean_df`. The output of the print() function shows the cleaned data

#### Note that the two rows with missing values `(index 5 and 7)` have been removed from the cleaned data. By removing these rows, we ensure that only valid data is used for analysis and prevent any errors or biases that may result from using incomplete data.

### 2. groupby():

In [24]:
# Create a DataFrame with student grades
data = {'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily', 'Frank', 'Grace', 'Henry'],
        'grade_level': ['freshman', 'sophomore', 'junior', 'senior', 'freshman', 'sophomore', 'junior', 'senior'],
        'grade': [90, 85, 95, 80, 92, 88, 94, 81]}
df = pd.DataFrame(data)
df

      name grade_level  grade
0    Alice    freshman     90
1      Bob   sophomore     85
2  Charlie      junior     95
3    David      senior     80
4    Emily    freshman     92
5    Frank   sophomore     88
6    Grace      junior     94
7    Henry      senior     81

In [25]:
# Group the data by grade level and compute the average grade
grouped_df = df.groupby('grade_level')['grade'].mean()

# Print the grouped data
print(grouped_df)

grade_level
freshman     91.0
junior       94.5
senior       80.5
sophomore    86.5
Name: grade, dtype: float64

#### The `groupby()` function is used to group the DataFrame df by the `grade_level` column, and the `ean()` function is applied to the `grade` column for each group to compute the average grade. The resulting grouped_df DataFrame contains the average grade for each grade level

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

#### In pandas, both `Series` and `DataFrame` are mutable in nature, meaning that their values can be changed after creation. However, `Panel` is an immutable data structure in pandas, which means that it cannot be modified once created and any changes made to them usually result in the creation of a new object..

#### To change the values in a `Series` or `DataFrame`, you can assign new values to specific locations using indexing or selection methods provided by pandas, such as .loc[] or .iloc[].

#### Note that while `Series` and `DataFrame` objects are mutable, it is generally recommended to avoid modifying them in place, as this can lead to unexpected results and errors. Instead, it is often better to create a new object with the desired modifications.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

#### We can create a Pandas DataFrame using multiple Series by passing a dictionary of Series to the pd.DataFrame() function. Each Series represents a column of the DataFrame, and the dictionary keys represent the column names.

#### Here's an example of creating a DataFrame using multiple Series:

In [33]:
# Create three Series with data for each column
course_name = pd.Series(['Full Stack Data Science','Data Science Master','Full Stack Web Developer'])
course_price = pd.Series(['20000','7500','20000'])
discount_price = pd.Series(['17000','3500','15000'])

# Create a dictionary of the Series
data = {'Courses':course_name,'Price':course_price,'Discount Price':discount_price}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data)
df

                    Courses  Price Discount Price
0   Full Stack Data Science  20000          17000
1       Data Science Master   7500           3500
2  Full Stack Web Developer  20000          15000